app/controllers/feed_cards_controller.rb

SELECT "feed_cards".* FROM "feed_cards"
---
  def index
    @feed_cards = FeedCard.all.reverse

INSERT INTO "feed_cards" ("img", "title", "content", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["img", ""], ["title", ""], ["content", ""], ["likes", 0], ["created_at", "2019-06-05 18:29:57.636340"], ["updated_at", "2019-06-05 18:29:57.636340"]]
---
  def create
    @feed_card = FeedCard.new(feed_card_params)
    @feed_card.user_id = params[:user_id]
    puts feed_card_params


    if @feed_card.save

UPDATE "feed_cards" SET "title" = $1, "user" = $2, "updated_at" = $3 WHERE "feed_cards"."id" = $4  [["title", "123"], ["user", ""], ["updated_at", "2019-06-05 19:04:38.021309"], ["id", 76]]
---
  def update
    if @feed_card.update(feed_card_params)

DELETE FROM "feed_cards" WHERE "feed_cards"."id" = $1  [["id", 26]]
---
  def destroy
    @feed_card.destroy

SELECT  "feed_cards".* FROM "feed_cards" WHERE "feed_cards"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
    def set_feed_card
      @feed_card = FeedCard.find(params[:id])